app/Controllers/UsuariosController.php

INSERT INTO `usuarios` (`nombre_usuario`, `apellido_usuario`, `email_usuario`, `password_usuario`, `estado_usuario`, `perfil_id`) VALUES ('Bruno', 'Santos', 'brusan@gmail.com', '$2y$10$Ic.cXsm1K4vxMk7gMpxqAur2DPTXYo/V0N0YKYNJiInVblSrBJRC6', 0, 2)
---

            ];
            //insertar en la tabla mensajes
            $Usuarios_Model->insert($data);

SELECT *
FROM `usuarios`
WHERE `email_usuario` = 'brusan@gmail.com'
 LIMIT 1
---
            $email = $request->getPost('email');
            $password = $request->getPost('password');

            $usuarioEncontrado = $Usuarios_Model->where('email_usuario', $email)->first();